
package com.muktotech.islamictvbangla;

import java.util.ArrayList;
import java.util.HashMap;

public class MakeVideoList {

	public static ArrayList< ArrayList<HashMap<String,String>> > rootArrayList;
	public static ArrayList< HashMap<String, String> > catArrayList;
	public static ArrayList< HashMap<String, String> > videoArrayList;
	public static HashMap<String, String> hashMap;


	//--------------------------------------------------------------------------------------------
	//===============================Some automation by Juba
	public static void addVideoItem(String video_id, String title, String desciption){
		hashMap = new HashMap<>();
		hashMap.put("vdo_id", video_id);
		hashMap.put("vdo_title", title);
		hashMap.put("vdo_desciption", desciption);
		videoArrayList.add(hashMap);
	}
	//========================================================================
	//===============================Some automation by Juba
	public static void createPlayList(String category_name, Integer drawable){
		rootArrayList.add(videoArrayList);
		hashMap = new HashMap<>();
		hashMap.put("category_name", category_name);
		hashMap.put("img", String.valueOf(drawable));
		catArrayList.add(hashMap);
		videoArrayList = new ArrayList<>();
	}
	//========================================================================





	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//----------------------------------------------------
	public static void createMyAlbums(){

		rootArrayList = new ArrayList();
		catArrayList = new ArrayList<>();
		videoArrayList = new ArrayList<>();

		//==========================================================================



		addVideoItem("76CayvF0flE", "নবী এবং রাসুলদের ধারাবাহিক জীবনী ", "Prophets Series | মিজানুর রহমান আজহারি");
		addVideoItem("ywHoaKVf0E4", "আদম (আ.) এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেট সিরিজের প্রথম এপিসোড— আদম (আ.) এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("S4JR8gWIvYg", "নূহ (আ.) এর জীবনী এবং আমাদের শিক্ষা ", "দ্বিতীয় পর্বে আমরা আলোচনা করেছি— “নূহ (আ.) এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("Qe9ylM6fNYM", "ইদ্রিস (আ.) এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেট সিরিজের তৃতীয় এপিসোড— ইদ্রিস (আ.) এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("Brnu5TgB0Jc", "হূদ (আ.) এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেট সিরিজের চতুর্থ এপিসোড—হূদ (আ.) এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("Pxf0L6PguOY", "সালেহ (আ:) এর জীবনী এবং আমাদের শিক্ষা", "প্রফেট সিরিজের পঞ্চম এপিসোড—সালেহ (আ:) এর জীবনী এবং আমাদের শিক্ষা ");
		addVideoItem("tSteK_9b5Q0", "ইব্রাহিম আঃ এর জীবনী এবং আমাদের শিক্ষা", "প্রফেট সিরিজের ৬ষ্ঠ এপিসোড—ইব্রাহিম আঃ এর জীবনী এবং আমাদের শিক্ষা ");
		addVideoItem("T8e9J_FleyE", "ইসমাঈল আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেট সিরিজের ৭তম এপিসোড—ইসমাঈল আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("LlLNy0Icf7M", "ইসহাক আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ৮ম পর্ব ॥ ইসহাক (আ.) এর জীবনী");
		addVideoItem("ntfdrLthUdg", "লুত আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ৯ম পর্ব ॥ লুত (আ.) এর জীবনী");
		addVideoItem("_CqhdVQztxg", "ইয়াকুব আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১০তম পর্ব ॥ ইয়াকুব আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("_lzwHFr2hBA", "ইউসুফ আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ 11তম পর্ব ॥ ইউসুফ আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("lN_0oRePY-g", "আইয়ুব আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১২তম পর্ব ॥ আইয়ুব আঃ এর জীবনী এবং আমাদের শিক্ষা ");
		addVideoItem("jcCEiN4xhFI", "শোয়াইব আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১৩তম পর্ব ॥ শোয়াইব আঃ এর জীবনী এবং আমাদের শিক্ষা ");
		addVideoItem("TbQJ6MKtp5Q", "মুসা আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১৪তম পর্ব ॥ মুসা আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("UPybeb9JdJs", "হারুন (আ:) এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১৫তম পর্ব ॥ হারুন (আ:) এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("UQokR2tslts", "যুল কিফল আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১৬তম পর্ব ॥ যুল কিফল আঃ এর জীবনী এবং আমাদের শিক্ষা ");
		addVideoItem("prZrvfpMQ9U", "দাউদ আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১৭তম পর্ব ॥ দাউদ আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("bFIheGltBC8", "সুলায়মান আঃ এর জীবনী এবং আমাদের শিক্ষা", "প্রফেটস সিরিজ ॥ ১৮তম পর্ব ॥ সুলায়মান আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("cWfNnCaH6MI", "ইলিয়াস আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ১৯তম পর্ব ॥ ইলিয়াস আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("vf0Df6XVTTc", "আল ইয়াসা’ আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২০তম পর্ব ॥ আল ইয়াসা’ আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("9_W1cFXWqrE", "ইউনুস আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২১তম পর্ব ॥ ইউনুস আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("4uvZtvQv6ow", "জাকারিয়া আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২২তম পর্ব ॥ জাকারিয়া আঃএর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("9KFO2P-0LhI", "ইয়াহইয়া আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২৩তম পর্ব ॥ ইয়াহইয়া আঃ এর জীবনী এবং আমাদের শিক্ষা ");
		addVideoItem("76CayvF0flE", "ঈসা আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২৪তম পর্ব ॥ ঈসা আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("MxkQM92MSzI", "হযরত মুহাম্মদ সাঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২৫তম পর্ব ॥ হযরত মুহাম্মদ সাঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("76CayvF0flE", "ঈসা আঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২৪তম পর্ব ॥ ঈসা আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("MxkQM92MSzI", "হযরত মুহাম্মদ সাঃ এর জীবনী এবং আমাদের শিক্ষা ", "প্রফেটস সিরিজ ॥ ২৫তম পর্ব ॥ হযরত মুহাম্মদ সাঃ এর জীবনী এবং আমাদের শিক্ষা");

		addVideoItem("8YMl24t7cQk", "The Significance of Dream in Islam | Mizanur Rahman Azhari ", "ইসলামে স্বপ্নের গুরুত্ব | মিজানুর রহমান আজহারি");
		addVideoItem("v52KJabFAaY", "Is Seafood Halal or Haram? | Mizanur Rahman Azhari ", "সামুদ্রিক প্রাণী খাওয়া হালাল নাকি হারাম? মিজানুর রহমান আজহারি ");
		addVideoItem("famZc8-oyNc", "শীতল আরশের নিচে ছায়া পাবেন যে ৭ শ্রেণীর ব্যক্তি | মিজানুর রহমান আজহারি", "7 Kinds of People Under the Shade of Allah's Throne | Mizanur Rahman Azhari");
		addVideoItem("pR74GPeZaCU", "ভালো মৃত্যু এবং খারাপ মৃত্যুর আলামত | মিজানুর রহমান আজহারি ", "Good Sign & Bad Sign of Death | Mizanur Rahman Azhari");
		addVideoItem("fBSuRJwzRdk", "মাজহাব মানেই কি বিভক্তি? | মিজানুর রহমান আজহারি ", "মাজহাব কি ও কেন?, মাজহাব মানা কি আবশ্যক?, মাজহাব চারটিতে সীমাবদ্ধ কেন?, মাজহাব মানেই কি বিভক্তি?");
		addVideoItem("mj_iEdd-Qpo", "শহীদ কারা? | Who are the martyrs in Islam? | মিজানুর রহমান আজহারি", "Who are the martyrs in Islam? Mizanur Rahman Azhari ");
		addVideoItem("60q6cvaLgWA", "কিভাবে আল্লাহর উপর ভরসা করব? || মিজানুর রহমান আজহারি", "সাধ্যের সবটুকু প্রচেষ্টা চালিয়ে অতঃপর আল্লাহর উপর ভরসা করার নাম হচ্ছে তাওয়াক্কুল ");
		addVideoItem("r40Dk-ABcho", "অমুসলিমদের সাথে মুসলিমদের সম্পর্ক কেমন হওয়া উচিত? মিজানুর রহমান আজহারি ", "How should be our relation to the people of different faith? by Mizanur Rahman Azhari.");
		addVideoItem("AsltzQW66ZA", "আসুন এ রমাদানে দানের হাতকে প্রশস্ত করি। মিজানুর রহমান আজহারি ", "আল্লাহ তায়ালা আমাদের সবাইকে ইসলাম ভালোভাবে বুঝার এবং মানার তাওফিক দান করুন। আমীন");
		addVideoItem("ndRcfgUHG1c", "রমাদানের প্রস্তুতি | Preparation for Ramadan | মিজানুর রহমান আজহারি ", "Preparation for Ramadan | মিজানুর রহমান আজহারি ");
		addVideoItem("_FLF5xEqNnY", "প্রাণীর ছবি অঙ্কনের ব্যাপারে কি বলে ইসলাম? | মিজানুর রহমান আজহারি ", "Is it Permissible to Draw Pictures in Islam? | Mizanur Rahman Azhari");
		addVideoItem("Av6Rg9kzMtA", "রাসূল (সা.) এর ডেইলি রুটিন | Daily Routine of Prophet Muhammad (pbuh) | মিজানুর রহমান আজহারি ", "Mizanur Rahman Azhari | Daily Routine of Prophet Muhammad (pbuh)");
		addVideoItem("AXJIj0AnbTA", "যাকাত - মিজানুর রহমান আজহারি", "Mizanur Rahman Azhari Zakat | Please do listen & Share the Khayr. আল্লাহ তায়ালা আমাদের সবাইকে ইসলাম ভালোভাবে বুঝার এবং মানার তাওফিক দান করুন। আমীন ");
		addVideoItem("3jtqM_EsUCQ", "Islam: A Role Model for Communal Harmony | Mizanur Rahman Azhari ", "ইসলাম সাম্প্রদায়িক সম্প্রীতির রোল মডেল | মিজানুর রহমান আজহারি ");
		addVideoItem("TZRKoUg0s8k", "Power of Sajdah by Mizanur Rahman Azhari | World Quran Convention 2022 ", "Keynote speech by Shaykh Dr. Mizanur Rahman Azhari on “Prostration: Divine Formula to Cope With Challenges”. Please do listen & Share the Khayr. আল্লাহ তায়ালা আমাদের সবাইকে ইসলাম ভালোভাবে বুঝার এবং মানার তাওফিক দান করুন। আমীন ");
		addVideoItem("eSg9pUaMceE", "ঈদ উদযাপনের সুন্নাহ সম্মত পদ্ধতি | মিজানুর রহমান আজহারি ", "Eid Mubarak | Mizanur Rahman Azhari");
		addVideoItem("rtfUhpB6MxQ", "যৌবনকালে ইবাদতের গুরুত্ব | মিজানুর রহমান আজহারি ", "জীবন চক্রের এক সোনালী অধ্যায় হলো যৌবনকাল ");
		addVideoItem("2pt2_EtVgcQ", "টিকটকার, ইউটিউবার এবং কন্টেন্ট ক্রিয়েটর ভাইদের সমীপে... মিজানুর রহমান আজহারি ", "সোশ্যাল মিডিয়ায় কোনো কন্টেন্ট শেয়ার করার পূর্বে প্রত্যেকের এ উপলব্ধিটুকু থাকা উচিত যে— আপনার কন্টেন্টের ভিউয়ার্স শুধু পৃথিবীর মানুষ নয়, দুই কাঁধের ফেরেশতা এবং স্বয়ং আল্লাহ তা'আলাও কিন্তু তা দেখেন।");
		addVideoItem("rtfUhpB6MxQ", "যৌবনকালে ইবাদতের গুরুত্ব | মিজানুর রহমান আজহারি ", "জীবন চক্রের এক সোনালী অধ্যায় হলো যৌবনকাল ");
		addVideoItem("2pt2_EtVgcQ", "টিকটকার, ইউটিউবার এবং কন্টেন্ট ক্রিয়েটর ভাইদের সমীপে... মিজানুর রহমান আজহারি ", "সোশ্যাল মিডিয়ায় কোনো কন্টেন্ট শেয়ার করার পূর্বে প্রত্যেকের এ উপলব্ধিটুকু থাকা উচিত যে— আপনার কন্টেন্টের ভিউয়ার্স শুধু পৃথিবীর মানুষ নয়, দুই কাঁধের ফেরেশতা এবং স্বয়ং আল্লাহ তা'আলাও কিন্তু তা দেখেন।");
		addVideoItem("j7Bv54ca9y8", "Mizanur Rahman Azhari | ইসলাম কি ধনী হতে নিরুৎসাহিত করে?", "Is it prohibited to become rich in Islam by Mizanur Rahman Azhari.");
		createPlayList("মিজানুর রহমান আজহারী", R.drawable.azhari);
		//==========================================================================

		//==========================================================================

		addVideoItem("M77ZFl-jEeU", "ভাগ্যে ভাল হওয়ার জন্য কি করবেন ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ)");
		addVideoItem("s0fxy5vC6yc", "কারবালার আসল ইতিহাস ", "Dr Khandaker Abdullah Jahangir The true history of karbala and the false story of bishad sindhudh, the true history of karbala and the lies of bishad sindhudh ");
		addVideoItem("PSsH421qRFA", "শবে বরাতের আমল ও ফয়িলত -ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর রহ. ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর রহিমাহুল্লাহর ");
		addVideoItem("e9xGZJPLEos", "সালাত নিয়ে শেষ্ঠ ওয়াজ ড. আব্দুল্লাহ জাহাঙ্গীর রহ. ", "Dr Khandaker Abdullah Jahangir Rahimahullah");
		addVideoItem("iEgRxsViXSY", "কবর জিয়ারতের সুন্নাত পদ্ধতি । ", "কবর জিয়ারতের সুন্নাত পদ্ধতি । মাসিক মাজলিসুস সুন্নাহ, আস-সুন্নাহ ট্রাস্ট, বাসটারমিনাল, ঝিনাইদহ। Dr. Khandaker Abdullah Jahangir");
		addVideoItem("hfPccKLGyaw", "Question Answer Part -ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর রহ.", "dr. khandaker abdullah jahangir ");
		addVideoItem("2-c1q7h9Uc4", "বিতর নামায কখন কি ভাবে পড়তে হয়।", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ) ");
		addVideoItem("nqEb-u6-Wgs", "তাবিজ ঝুলানো কি শিরক ? ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর রহ. ", "তাবিজ ঝুলানো কি শিরক? ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর রহ.");
		addVideoItem("NQRnPgY_Ha4", "পীরের হাতে বায়াত হওয়া ফরয কি ? ", "Dr. Khandaker Abdullah Jahangir");
		addVideoItem("WManJmai2tM", "সূরা ফাতিহার তাফসীর ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ)");
		addVideoItem("2qZtwnOOmq4", "দুআ ইউনুস খতমে কি আসলেই দুআ কবুল হয়? ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ)");
		addVideoItem("D9CSRU6vj7s", "একটা আমল খুব কঠিন দেখুন আমল করতে পারেন কি না। ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ) প্রতিষ্ঠিত");
		addVideoItem("E8ts_oghcP4", "কিছু সুন্নত জীবন্ত আর কিছু সুন্নত মরন্ত আছে ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ) ");
		addVideoItem("A_IVwrTV3Cc", "আমাদের নামাজ না হওয়ার কারণ। ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ) ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ)");
		addVideoItem("Lr81qM8hxO4", "নামাজ না পড়লে কি ঈমান থাকে ", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ) নামাজ না পড়লে কি ইমান থাকে। বিপদ আসলে কি করবেন।");
		addVideoItem("Llz7nqY3emA", "মুনাজাত বিদআত, ইলিয়াসী তাবলিগ বিদআত, মিডিয়া বিদআত নয় কেন? ", "Dr.Khandaker Abdullah Jahangir ");
		addVideoItem("BheG4ERb6Oc", "স্বামী ও স্ত্রীর জন্য গুরুত্বপূর্ণ কিছু নছিহত।", "ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্লাহ)");
		addVideoItem("BpOSKV1-7N4", "যে কারণে স্ত্রী জাহান্নামী হলে স্বামীও জাহান্নামী হতে পারে !! ", "শাড়ী পরিধান করে সালাত হবে না। ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর (রাহিমাহুল্রাহ)");
		addVideoItem("iFwG3vQ25TE", "ছেলে-মেয়ের মাঝে সম্পত্তি বণ্টনের হুকুম- ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর", "Dr Khandaker Abdullah Jahangir Rahimahullah");
		addVideoItem("9e53Kk-mSC0", "মাযহাব মানা যাবে কি? ড. আব্দুল্লাহ জাহাঙ্গীর রহ ", "Dr. Khandaker Abdullah Jahangir (Rahimah allah)");

		createPlayList("ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর",R.drawable.abdullahsir);
		//==========================================================================


		//==========================================================================


		//==========================================================================


		//==========================================================================
		addVideoItem("ZZVEtW3j9ug", "ওজুতে যেভুলগুলো হয়তো আপনারও হয়-শাইখ আহমাদুল্লাহ ", "ওজুর যেভুলগুলো হয়তো আপনিও করেন-শাইখ আহমাদুল্লাহ");
		addVideoItem("j9XD_UItaWs", "এই আলোচনা শোনার পর ফজরে আর অলসতা হবে না ইন শা আল্লাহ - শাইখ আহমাদুল্লাহ ", "ফজরের নামাজের ১০টি ফজীলত - শাইখ আহমাদুল্লাহ");
		addVideoItem("fpOiIxw9ejg", "যেসব কাজে জীবনের সব কিছুতে বরকত নেমে আসে। বরকতের ১০টি চাবি -শাইখ আহমাদুল্লাহ ", "বরকত জিনিসটা কি?বরকতের প্রয়োজনীয়তা কতখানি?");
		addVideoItem("2WrYDqcFHkQ", "১৩ শ্রেণীর হতভাগা যাদের আমল-ইবাদত কবুল হয় না! ", "আলহামদুলিল্লাহ, এই ১৩ শ্রেণির মানুষের মধ্যে যেন আমাদের না নেয়, মহান আল্লাহ আমাদের কবুল করুক।");
		addVideoItem("LaxXzlyC1Kk", "১৭ শ্রেণীর লোক মুসলমান হয়েও জান্নাতে যেতে পারবে না! -শায়খ আহমাদুল্লাহ? ", "দেখে নিন আপনি এর মধ্যে আছেন কি না?");
		addVideoItem("iHP1lkcVgJA", "যে ৬টি আমল মীযানের পাল্লায় সবচেয়ে ভারী হবে -শায়খ আহমাদুল্লাহ", "আলহামদুলিল্লাহ,আপনার আলোচনা  একজন মুসলমানের জন্য অত্যন্ত জরুরী।আল্লাহ পাক আপনাকে নেক হায়াত দান করুন।আমিন। ");
		addVideoItem("pg9jg-kPvyM", "ফরজ গোসল করার সঠিক নিয়ম - শায়খ আহমাদুল্লাহ", "অনেকের মতে কেবল প্রথম দু'টিই ফরজ। আলোচনায় বর্ণিত গোসলের পদ্ধতিতে ফরজ ও সুন্নাহ সব আলোচিত হয়েছে। ফরজ গোসল করার সঠিক নিয়ম ভিডিওতে আলোচিত হয়েছে");
		addVideoItem("gIQFSTr4wPY", "কবীরা গুনাহের মধ্যে সবচেয়ে বড় এবং জঘন্য ৩টি কবীরা গুনাহ -শাইখ আহমাদুল্লাহ ", "হে আল্লাহ আমাদের কে শিরক্ বিদ্আত এবং সকল প্রকার অশ্লীলতা ও পাপাচার থেকে হেফাজত করুন, বাঁচিয়ে রাখুন আমীন আমীন আমীন।");
		addVideoItem("jOpE9lMqDqE", "ইসলামী ব্যাংকে টাকা রেখে লভ্যাংশ খাওয়া কি হালাল হবে?-শায়খ আহমাদুল্লাহ", "আলহামদুলিল্লাহ আল্লাহ আমাদের সকলকে হেদায়েত দান করুন");
		addVideoItem("oBYcqcXha5E", "শিশুর জন্মের পর পিতামাতার ১১টি করণীয় -শায়খ আহমাদুল্লাহ ", "শিশুর জন্মের পর বাবা মায়ের ১১টি করণীয় -শায়খ আহমাদুল্লাহ Bangla Waz Ahmadullah");
		addVideoItem("_sRQopngSo0", "ইসমে আজম : মনের আশা পূরণ হওয়ার দোয়া", "আল্লাহুম্মা ইন্নী আস আলুকা, বিআন্নী আশহাদু আন্নাকা আংতাল্লাহ, লা-ইলাহা ইল্লা আংতাল আ'হাদুস সামাদ, আল্লাজী লাম ইয়ালিদ ওয়া লাম ইউলাদ ওয়ালাম ইয়া কুল্লাহূ কুফুওয়ান আ'হাদ।");
		addVideoItem("q7Oto0XnZFs", "একমাত্র এই আমলটিই বেশি বেশি করতে বলা হয়েছে কুরআনে By Sayekh Ahmadullah ", "আল্লাহর কাছে সব চেয়ে প্রিয় চার টি বাক্য সুবহানাল্লাহ, আলহামদুলিল্লাহ,আল্লাহু আকবার,লা- ইলাহা ইল্লাল্লাহ।আল্লাহ আমাদের বেশি বেশি আমল করার তৌফিক দিন।আমিন।");
		addVideoItem("7dabAbqxsWY", "কিভাবে বুঝবেন আল্লাহ কাকে ভালোবাসেন? জেনে নিন আল্লাহর ভালোবাসার ৪ আলামত", "আল্লাহ কাকে বেশি ভালোবাসেন?  ❤️❤️শায়েখ আহমাদুল্লাহ ❤️❤️ ");
		addVideoItem("URYqRyTwfuw", "জান্নাতী লোকের ১৪ আলামত -শাইখ আহমাদুল্লাহ ", "জান্নাতী লোকের আলামত -শাইখ আহমাদুল্লাহ ");
		addVideoItem("x-iOBIOTvjU", "আউযুবিল্লাহ ও বিসমিল্লাহ কোথায় কোনটা পড়বেন? দু'আ-দরূদ পড়তে কি বিসমিল্লাহ পড়তে হবে? -শায়খ আহমাদুল্লাহ ", "আলহামদুলিল্লাহ আল্লাহ আমাদের সকলকে হেদায়েত দান করুন");
		addVideoItem("f5pJiG3jwYA", "যে আমল করলে আপনার সকল দু'আ কবুল হবে, কোন দু'আ আল্লাহ ফেরত দিবেন না।। শায়খ আহমাদুল্লাহ", "যার কোন দু'আ ফেরত দেন না আল্লাহ তা'আলা, তাকে বলা হয় মুস্তাজাবুদ দ্বা'ওয়াহ। সেই সৌভাগ্যবান ব্যক্তি হতে হলে এই আমলটি করুন।");
		addVideoItem("YEmPfY5OP20", "মেয়েরা কি স্বামীর বাম পাঁজরের হাড় থেকে সৃষ্টি হয়েছেন? ", "আলহামদুলিল্লাহ আল্লাহ আমাদের সকলকে হেদায়েত দান করুন ");
		addVideoItem("R6E43Xo4lZo", "আযানের জবাব দেওয়ার এতো সওয়াব!! শুনলে অবাক হবেন!!", "মুআযযিনের আযান শুনে যতো লোক নামাজ পড়ে তাদের সবার সমপরিমাণ সওয়াব হবে অতি ছোট এই আমলে: শাইখ আহমাদুল্লাহ");
		addVideoItem("9Yx2tp6nH_4", "শবে কদরের নামাজ", "শবে কদরের নামাজ: কিভাবে পড়বেন? কত রাকাত পড়বেন?");
		addVideoItem("rwuxgJnjgl0", "যে সর্বনাশা গুনাহ এ যুগে ৯৯% মানুষ করে! -শায়খ আহমাদুল্লাহ ", "সচ্ছরিত্র এ যুগে সোনার হরিণ, জেনে নিন এর মূল্য কুরআন-সুন্নাহর আলোকে সচ্ছরিত্রের উপকারিতা");
		addVideoItem("YP3Tr2xJnJg", "কারো গায়ে পা লেগে গেলে কি তার কাছে মাফ চাওয়া উচিত? ", "আল্লাহ তাআলা আমাদের সবাইকে সঠিক পথে চলার তৌফিক দান করুন");
		addVideoItem("nzzGWbhlD0U", "হিংসুকের হিংসার ক্ষতি থেকে রক্ষার ৫টি উপায় -শায়খ আহমাদুল্লাহ ", "আল্লাহ তাআলা আমাদের সবাইকে সঠিক পথে চলার তৌফিক দান করুন");
		addVideoItem("Uj86EQaMGgY", "যারা জাহান্নামে যাবে তারা কি চিরকাল জাহান্নামে থাকবে? ", "আল্লাহ তাআলা আমাদের সবাইকে সঠিক পথে চলার তৌফিক দান করুন");
		addVideoItem("gyV5DhZVwyc", "রাসুল (সা:) বলেছেন-এই দুআ পড়লে সেদিনে আপনার চেয়ে বেশি সওয়াব কেউ উপার্জন করতে পারবে না ", "রাসুল (সা:) বলেছেন-এই দুআ পড়লে সেদিনে আপনার চেয়ে বেশি সওয়াব কেউ উপার্জন করতে পারবে না -শাইখ আহমাদুল্লাহ ");
		addVideoItem("lnbdr-6WHpw", "রাত বারোটার পর এশার নামাজ পড়া যাবে কি? ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("iKhgNWyyUL4", "কুরবানী সম্পর্কিত ৫২টি অতিগুরুত্বপূর্ণ প্রশ্নের উত্তর ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("srjwSq-vSj0", "জন্ম, মৃত্যু, বিয়ে-এ তিনটি বিষয় আল্লাহর হাতে- এ কথা কি ঠিক? ", "#জন্ম_মৃত্যু_বিয়ে_এ তিনটি বিষয় #আল্লাহর_হাতে");
		addVideoItem("a49wFghTFK8", "ঘুমের কারণে দেরিতে ফজরের নামাজ পড়লে কি গুনাহ হবে?- শাইখ আহমাদুল্লাহ ", "যারা ফজরের নামাজ সূর্য ওঠার পর পড়েন তাদের বিধান- শাইখ আহমাদুল্লাহ");
		addVideoItem("vhoDVxOByoQ", "যেই ৮ শ্রেণীর মানুষকে স্বয়ং আল্লাহ ভালোবাসেন বলে জানিয়েছেন কুরআনে ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("j2-B4ojMT9c", "শুক্রবারে মাত্র কয়েক মিনিটে হাজার হাজার বছর ইবাদতের সওয়াব লাভের উপায় -শায়খ আহমাদুল্লাহ ", "মেয়েরা অন্যদের উদ্বুদ্ধ করে সহায়তা করে একই সওয়াব পেতে পারেন।");
		addVideoItem("kLG49PbpdmA", "দুশ্চিন্তা, ডিপ্রেশন ও কঠিন বিপদাপদ থেকে মুক্তির ৭ উপায় ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("8vSTHPf7Zr4", "কাপড় পাক করার সঠিক এবং ভুল নিয়ম ", "নাপাক কাপড় পাক করার কয়েকটি সঠিক নিয়ম। যেভাবে কাপড় ধোয়ার কারণে অনেকের কাপড়ই নাপাক থেকে যায়।");
		addVideoItem("iDIvMcPMhCY", "কাপড় খারাপের অজুহাতে যারা নামাজ পড়েন না, তাদের জন্য কয়েকটি টীপস-শায়খ আহমাদুল্লাহ ", "কাপড় খারাপ,  নামাজের জন্য আর কোন কাপড় নাই/ঘর্মাক্ত ও ডিউটির পোষাকে নামাজ/সুঁয়ের আগার মতো পেশাবের ছিঁটা লাগা ও পবিত্রতা সংক্রান্ত বিবিধ গুরুত্বপূর্ণ প্রশ্নের উত্তর।।");
		addVideoItem("BKWai4SSMo0", "নামাজের বড় কিছু ভুল!", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("7vaikEfmj1A", "যারা আমল দিয়ে সব পাপ মুছে ফেলতে চান তারা শুনুন ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("QikwCiulM8w", "আশুরার ইতিহাস বনাম কারবালার ট্রাজেডি এবং আশুরার করণীয় ও বর্জনীয়- শাইখ আহমাদুল্লাহ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("dBC_n6hucbM", "কুরবানীতে যে ভুলগুলো প্রায় সবার হয়: By Shayekh Ahmadullah ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("EYZYG6Mmis4", "৫ শ্রেনীর মানুষের দু'আ আল্লাহ ফিরিয়ে দেন না, কবুল করেন - শাইখ আহমাদুল্লাহ ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("CSl-USjGihU", "যেসব কাজে ঈমানী মৃত্যু সহজ হবে ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("FnqDKMBDyNo", "রিযিক ও হায়াত চূড়ান্তভাবে নির্ধারিত, তাহলে নেক আমলে হায়াত বা রিযিক বাড়ে কিভাবে? ", "রিযিক ও হায়াত চূড়ান্তভাবে নির্ধারিত, অথচ হাদীসু বহু আমলের বিনিময়ে হায়াত বা রিযিক বাড়ার কথা বলা হয়েছে, সেটা কিভাবে?");
		addVideoItem("sC7ATx893gc", "ছোট্ট একটি আমলে জীবনের ৮টি প্রধান সমস্যার সমাধান ও একটি সারপ্রাইজ পুরস্কার -শায়খ আহমাদুল্লাহ ", "ছোট্ট একটি আমলে জীবনের ৮টি প্রধান সমস্যার সমাধান ও একটি সারপ্রাইজ পুরস্কার -শায়খ আহমাদুল্লাহ");
		addVideoItem("Sf5_9jA_TBU", "৪০ দিনের বেশি নাভির নিচের লোম পরিস্কার না করলে নামাজ হবে না? ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("rYufzX5aWvw", "দুষ্ট জিনের উপদ্রব থেকে বাঁচার ১২টি উপায় ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("0PE_jDSzJDw", "মক্কা-মদীনার চেয়েও ঘটনাবহুল-সিরিয়া সম্পর্কে রাসুল (সা:) এর ১০টি ভবিষ্যদ্বাণী -শায়খ আহমাদুল্লাহ ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("LoW56cF_cdM", "যে কথা বলতে গিয়ে আল্লাহ ৭ বার শপথ করেছেন! ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("DdGWgxDv-R0", "ওজুর সময় যে গুনাহটি সবাই করেন! ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("LoW56cF_cdM", "যে কথা বলতে গিয়ে আল্লাহ ৭ বার শপথ করেছেন! ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		addVideoItem("DdGWgxDv-R0", "ওজুর সময় যে গুনাহটি সবাই করেন! ", "আল্লাহ্‌ আমাদেরকে ইসলাম বুঝারমত শক্তি দান করুন");
		createPlayList("শায়খ আহমাদুল্লাহ", R.drawable.ahmadullah);
		//==========================================================================
		//==========================================================================
		addVideoItem("BUg2ToCUMhI", "নবী মুসা ও খিজির আঃ এর কাহিনী - আবু ত্ব-হা মুহাম্মদ আদনান ", "হযরত খিজির এবং মুসা আঃ এর শিক্ষনীয় ঘটনা || কে বেশি জ্ঞানী? আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("j1ecjSQQBCA", "বিপদ থেকে বেঁচে থাকার আমল || আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");

		addVideoItem("ieHeHbGtm0g", "প্রত্যেক মেয়ে এই লেকচারটি শুনবেন || আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("2uYNlX-CJUI", "মুমিন ও মুসলমান কারা? আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("PUhKxAsaDO0", "নবীজি (স) কে করা জিবরাঈল আমিনের ৫ টি প্রশ্ন | আবু ত্ব-হা মুহাম্মদ আদনা ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("o8KNQtZ-Dlk", "তাকদীর বা ভাগ্য কি পরিবর্তন করা যায়? আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("PHQiVRKWmVE", "এই দুনিয়াতে আল্লাহ ছাড়া আপন কেউ নাই || আবু ত্ব-হা মুহাম্মদ আদনান", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("NThMkhdFS-Y", "উমর (রাঃ) এর সাহস ও ইসলাম গ্রহণের সত‍্য ঘটনা || আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("cILy9Valw6o", "শেষ জামানার কিছু নির্মম বাস্তবতা || আবু ত্বহা মুহাম্মদ আদনান  ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("o8DqaHFgMt4", "বাচ্চাদের সাথে কাটানো আবু ত্বহা আদনান এর কিছু মজার মুহুর্ত ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("jFF9rVPWRRQ", "রিজিক নিয়ে টেনশন করবেন না প্রিয় ভাই | আবু ত্বহা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("U8d3G7lpjd4", "নারীরা কেনো বেশি জাহান্নামে যাবে ? আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("SP7lI04Ch_Q", "আদিম যুগে মানুষ গাছের ছাল-পাতা পড়ে থাকত না | আবু ত্বহা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান ");
		addVideoItem("zFvVz09_xHI", "সিজার নিয়ে অবাক করা তথ্য | আবু ত্বহা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান ");
		addVideoItem("5jiB5FfFsUM", "আসহাবুল উখদুদ: গর্তওয়ালাদের কাহিনী || আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("s8tnS9mOtHY", "ইবাদাতে স্বাদ পাওয়ার কিছু টিপস | আবু ত্বহা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("JPKjx7Nqs_c", "উঠতে বসতে সবসময় যে আমলটি করবেন | আবু ত্বহা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("hgVta8TwB5U", "শাকিব খানের হাতে চুমু খাওয়া সেই বোরখা পড়া মেয়েকে নিয়ে কঠিন কিছু কথা: abu taha muhammad adnan 2022", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("bERkp98wTR0", "কিছু গুরুত্বপূর্ণ নসীহা - আবু ত্ব-হা মুহাম্মদ আদনান | Abu Toha Muhammad Adnan । Bangla waz 2021", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("C2J0q5Bsk5g", "কথাগুলো আপনার অন্তরকে নাড়া দিবে || আবু ত্ব-হা মুহাম্মদ আদনান || Abu Toha Muhammad Adnan ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("j7xQTQG2hMA", "হক কথা বললে বিপদ আসবেই || আবু ত্ব-হা মুহাম্মদ আদনান || Abu Toha Muhammad Adnan || New Waz 2021", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("HM5zoCp47jo", "উহুদের ময়দানে দাঁড়িয়ে আবু ত্বহা মুহাম্মাদ আদনান | abu taha muhammad adnan waz | উহুদ যু দ্ধে র ঘটনা", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("8mw1e-T4vR8", "আশুরার ইতিহাস | হাসান হুসাইন রাঃ ও তার পরের কাহিনি | abu taha muhammad adnan | karbala ashura ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("O5Jyve3gUO0", "ইমাম মা*হ্দী ও দাজ্জা*লের যুদ্ধ কেমন হবে ? আবু ত্ব-হা মুহাম্মদ আদনান | Abu Toha Muhammad Adnan ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("JsAORAb6hZs", "দাজ্জা*ল কি এখনো শিকল দিয়ে বাঁধা? দাজ্জা*ল কোথায় ? আবু ত্ব-হা মুহাম্মদ আদনান | Abu Toha Adnan", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("TjtN-itmFE4", "নিজ পিতার সাথে অনৈতিক সম্পর্ক!! যা বললেন আবু ত্বহা মুহাম্মদ আদনান | abu taha muhammad adnan waz ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("e-C9wn8fKlo", "যুবকদের জন্য অসাধারণ লেকচার || আবু ত্ব-হা মুহাম্মদ আদনান || Abu Toha Muhammad Adnan || Bangla Waz ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("dncLp3vLIYU", "বিদায় হজ্বের ভাষণ | যা আমরা অনেকেই জানি না: আবু ত্বহা মুহাম্মদ আদনান | abu taha muhammad adnan 2022 ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("71FlxqZFGZE", "গর্তওয়ালাদের কাহিনীঃ কুরআনে বর্নিত সেরা গল্প | আবু ত্বহা মুহাম্মদ আদনান | abu taha muhammad adnan ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("p84hZkIaL04", "এই আলোচনা শুনার পর আপনি নামাজ শুরু করতে বাধ্য - আবু ত্বহা মুহাম্মাদ আদনান ", "প্রফেটস সিরিজ ॥ ২৪তম পর্ব ॥ ঈসা আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("4OzufcND7jE", "জীবনে বরকত আসার আমল | আবু ত্বহা মুহাম্মদ আদনান | ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("qUbo6Y5vMDI", "দুরুদ শরীফের পাওয়ার জেনে নিন | আবু ত্বহা মুহাম্মদ আদনান", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("7npd3SnVBCE", "ঢাকা সিটি: একটি কেয়ামতের শহর - Part: 1 || আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("34_fwTy7Khg", "আজকে মারা যান, কাল কেই সবাই ভুলে যাবে || আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("ugA5p4S9L4w", "মুসলিম হয়েও নামাজ পড়ছে না, সুদ খাচ্ছে!! আবু ত্ব-হা মুহাম্মদ আদনান ", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("5Kv27Fj7aQ8", "আসহাবুল কাহাফ এর ঘটনা | ৭ যুবক ও কুকুর এর গল্প | আবু ত্ব-হা মুহাম্মদ আদনান", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		createPlayList("আবু ত্বহা মুহাম্মদ আদনান", R.drawable.toha);
		//==========================================================================
		addVideoItem("r1Brf8bVA_M", "কবরে প্রশ্ন হবে পাঁচটি! প্রস্তুতি নিয়েছেন তিনটির তাইনা? ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("_LzAlFnGXv0", "ড.আব্দুল্লাহ জাহাঙ্গীর রা.শেষ ইচ্ছা...Dr.Abdullah Jahanggir's last wish.. ", "যে কথাগুলি প্রত্যেক দায়ী,মুফাসসির,ওয়ায়েজের শোনা উচিৎ,তালেবে ইলমদের জন্যে খুব জরুরী বয়ান।");

		addVideoItem("GiFwACMaaEQ", "যে গুন থাকলে সব দুয়াই কবুল হয় অবিশ্বাস্য! সুবহানাল্লাহ!", "আলোচনায়: আবু ত্ব-হা মুহাম্মাদ আদনান");
		addVideoItem("XmpDe9PBXis", "মানসিক অশান্তি আর ধার দেনা থেকে বাচার আমল জেনে নিন ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("ZGlwKgaDLVU", "জীবনের মোড় ঘুরানো বয়ান!আল-কুরআনের দুয়া:রাব্বানা ও রাব্বিঃমুমিন জীবনের পাথেয়:চাইলেই কবুল!!", "যে দুয়া আল্লাহ ফিরাবেন না! সেটি কোন দুয়া?কেনো করবেন? কিভাবে করবেন?আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("_tUUFtIFjWk", "সূরা বাকারার শেষ দুই আয়াতের অনন্য বিশ্লেষনঃ নওগাঁ কাচারী মাসজিদ। abdul hi muhammad saifullah ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("xSgQSrYAhIU", "কাবা যাদুঘরে ৯ মিনিট।। দশটি অসাধারন অদেখা আশ্চর্য।।", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("b2Oqs1DzaWQ", "মিরাজে রাসুল সা আল্লাহকে দেখেছেন?", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("bsKojuHLrAc", "অহংকার কাকে বলে?বুঝার উপায় কি?দূর করার পদ্ধতি কি?একাডেমিক লেকচার।। ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("CoUAFxawSY4", "আল্লাহর জন্য রাত্রি জাগরন।।মুমিন জীবনে সফলতার চাবি।।নতুন বয়ান।।আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("jlm3snn1rYc", "দান মানেই মাসজিদ আর মাদরাসা?যাকাত দাতা দানবীর?কোথাও ভুল হচ্ছে নাতো? ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("gBmZIAmMKg0", "ঘুমানোর আগে যে আমলে সব বিপদ আপদ ও চাহিদা পূরণ হয়! ", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("BfaH3UctMAI", "একটি দুয়াই জীবনের সব সমস্যা বিপদ মুসিবতের জন্য যথেষ্ট", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");addVideoItem("eUtkv_RuSNQ", "সুন্দরী বউ ,পার্লার,কমিউনিটি সেন্টার আর সেলফি তোলা নব দম্পতি শুনুন", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ ");
		addVideoItem("vZECebZJKIc", "শবে মেরাজের রাত কবে?নামাজ আর রোজা আছে কী?", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("NCh8pT7po0g", "শবে বরাত নিয়ে পরিস্কার কিছু কথা!দোনোমোনো করবেন না!!", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("O_A7qqcgHKs", "টাকনুর নিচে প্যান্ট গেলেই হুজুররা এত ফতুয়া দেয় কেন??", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("Mvg1IxOLVds", "দুটি গল্পে চরিত্র শিক্ষা ।।সাইফুল্লাহ।।নতুন ওয়ায।।", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("TNQmBEOqL04", "মূখে কাপড় পেঁচিয়ে গায়ে শার্ট, জিন্সের প্যান্ট পরেও নাকি হিজাবি পর্দানশীন!", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("6fCMlVFwiM0", "কুরআন দেখেদেখে নামাজ পড়া?তিন সূরা দিয়ে বিশ রাকাত নামাজ পড়ার সহজ উপায়!তারাবী নাপড়ে রোজা থেকে লাভ আছে?", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("o_ZBsX7Msiw", "যাদের তিন জুমা মিস হয়েছে তাদের কী হবে?ঈমান থাকবেনা শুনেছি তিন জুমা ছাড়লে?।।saifullah", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("yt4oA8gGX4A", "প্রশ্নোত্তর পর্বঃ১শিয়া ও আহলে হাদিস ভাইদের সাথে আত্মীয়তা ও তাদের মসজিদে সালাত পরা যাবে কি?", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("LfF5Bem4h0s", "আমাদের পতনের দুই কারনঃবিদ'আত আর কুসংস্কারঃকিন্তু কীভাবে?", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("wwwrWxzsrPw", "তারাবী:উম্মাহর বিভক্তি:রাকাত ফর‍য নাকি নফল?", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("8756Oq5_YwA", "তাহাজ্জুদ।। শুরু থেকে শেষ।। একটি জানা বিষয়ে অজানা বয়ান।। পুরো আলোচনা। সাইফুল্লাহ।।", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("xTUAesM6Ta0", "অন্তরের বিশুদ্ধতাঃকেনো জরূরী?কীভাবে সম্ভব?।।ইসলাহী বয়ান", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");
		addVideoItem("pv-ccGhIwUk", "বান্দাকে দেয়া শ্রেষ্ঠ তিনটি নেয়ামত যা আল্লাহ বলেছেন!", "আব্দুল হাই মুহাম্মাদ সাইফুল্লাহ");

		createPlayList("আব্দুল হাই মোহাম্মদ সাইফুল্লাহ", R.drawable.saifullah);
		//==========================================================================
		addVideoItem("1YfSFfmCg5o", "সূরা ফাতিহার বিস্ময়কর তাফসীর - নোমান আলী খান - বাংলা ডাবিং", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য।");
		addVideoItem("Klz5rJ95p_A", "জিব্রাইল আঃ এর গল্প বাংলা ডাবিং - শায়েখ ওমর সুলেইমান", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("t2pSiH_KSDg", "যেভাবে আমরা ঈমান হারাই - উস্তাদ নোমান আলী খান । বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("t2pSiH_KSDg", "যেভাবে আমরা ঈমান হারাই - উস্তাদ নোমান আলী খান । বাংলা ডাবিং", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("G8ljaRJ3Dd4", "বিচার দিবসে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম - নোমান আলী খান", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("9IvDyCtuMz4", "দু'আ কীভাবে কাজ করে? নোমান আলী খান।", " আপনি যাকে পছন্দ করেন, তাকে সৎপথে আনতে পারবেন না, তবে আল্লাহ তাআলাই যাকে ইচ্ছা সৎপথে আনয়ন করেন। কে সৎপথে আসবে, সে সম্পর্কে তিনিই ভাল জানেন। ");
		addVideoItem("pDnDbOZ8Xhs", "আয়াতুল কুরসী আল কুরআনের এক অসাধারণ সৌন্দর্য্য - নোমান আলী খান - বাংলা ডাবিং", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("WTq5zq2bH44", "আল্লাহর কাছে কী চাইবো? বাংলা ডাবিং - নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("W_Pf10psvi8", "আল্লাহর সিদ্ধান্তের কাছে বিনয়ী হোন || নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("OBuUN7YM1GE", "একটি সহজ জীবন (সূরা আলাম নাশরাহ-র তাফসীর) - নোমান আলী খান", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("vhZQ_-LWzYk", "কখনো হতাশ হবেন না - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("2o-7SpBlfu8", "প্রজ্ঞার প্রয়োজনীয়তা - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("2NYiimq6D1E", "আল্লাহর নিকট আত্ম সমর্পনের পুরস্কার - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("J6HoIsOkV8A", "সূরা আসরের সম্পূর্ণ তাফসির || সব পর্ব একসাথে || নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("RJlNtFEMbHU", "ধার্মিক ব্যক্তি যখন পথভ্রষ্ট হয়ে পড়ে - উস্তাদ নোমান আলী খান ", "আর আপনি তাদেরকে শুনিয়ে দিন, সে লোকের অবস্থা, যাকে আমি নিজের নিদর্শনসমূহ দান করেছিলাম, অথচ সে তা পরিহার করে বেরিয়ে গেছে। আর তার পেছনে লেগেছে শয়তান, ফলে সে পথভ্রষ্টদের অন্তর্ভূক্ত হয়ে পড়েছে।");
		addVideoItem("d_Irm7ztrs0", "শয়তান যেভাবে সামনের দিক থেকে আক্রমণ করে - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("o47mr8v-xYI", "নিজেকে আবিষ্কার করুন - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("640R4vz4S_Y", "আল-কুরআন: চূড়ান্ত মু'জিজা || উস্তাদ নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("LRsKMxownrU", "হিংসা থেকে সাবধান থাকুন - উস্তাদ নোমান আলী খান - বাংলা ডাবিং", "Nouman Ali Khan Bangla Dubbing Lecture");
		addVideoItem("yv_vRCScI28", "মানুষের চূড়ান্ত কুৎসিত রূপ || নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("uYHSVeRPYFw", "সূরা আসরের বিস্তারিত তাফসীর (১ম পর্ব) || নোমান আলী খান।", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("kqftOcEcn_4", "কীভাবে ঈমানের সাথে বিপদ-মুসিবত মোকাবেলা করবেন? উস্তাদ নোমান আলী খান", "Nouman Ali Khan Bangla Dubbing Lecture");
		addVideoItem("8Tm5NFiCaNM", "কিসে তোমাকে প্রতারিত করলো? || নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("EAENdLenCys", "ব্যক্তিগত উন্নয়নের তিনটি ক্ষেত্র - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("qY90Gi1XrSA", "মৌমাছির মত হও - নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("ifYjHxh9W0M", "সুবহানাল্লাহ অর্থ - উস্তাদ নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("y2w7WXqmI-0", "সূরা আল কদরের তাফসির। নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("f8V1ScLzOxY", "জীবন পরিবর্তন করার ৪ টি ধাপ কুরআনের আলোকে।। নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("kGUV0MUQnxc", "সৎ উপার্জনের সম্মান - উস্তাদ নোমান আলী খান | বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("0r7aWwFhhoM", "ঈমানের সংরক্ষণ - উস্তাদ নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("X1zFHWiP2Y0", "একাকি সময়ে পাপকাজ থেকে বেঁচে চলা - নোমান আলী খান (বাংলা ডাবিং) ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("TvnOngfc_h0", "(নতুন ডাবিং) কৃতজ্ঞতার শক্তি || নোমান আলী খান", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("bnzDEhyeI7c", "জীবনে কেন বিপদ ঘটে - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য ");
		addVideoItem("xJr8n77CkEw", "সঠিক নিয়ত - বাংলা ডাবিং - উস্তাদ নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("6jxRDbqDxlI", "রোগাক্রান্ত অন্তর - নোমান আলী খান বাংলা ডাবিং", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("t6HPg3V3So0", "(বাংলা ডাবিং) আমাদের পাশে থাকা ফেরেশতারা এবং জান্নাতের সুসংবাদ - নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("xWSxneQxERg", "বাংলা ডাবিং - জান্নাতে থাকা মানুষেরা - নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("0NyBhGx4W5c", "সোলাইমান (আঃ) এর দোয়া -- Nouman Ali Khan Bangla Dubbing ", "Nouman Ali Khan Bangla Dubbing Lecture");
		addVideoItem("rFvYwuTN7WY", "আল্লাহ, যিনি সর্বশক্তিমান - নোমান আলী খান (বাংলা ডাবিং) ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("lL-BPMoF0y8", "আপনার সন্তানকে কিভাবে ইসলামের শিক্ষা দেবেন - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("VLL_6_RtNus", "রাগকে নিয়ন্ত্রণ করুন - নোমান আলী খান (বাংলা ডাবিং) ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("L29Igj8MfsU", "ইসলামের অত্যাবশ্যকীয় উপাদানসমূহ - নোমান আলী খান - বাংলা ডাবিং ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("uA2dB2Ty2sU", "বাবার উপদেশ - উস্তাদ নোমান আলী খান - বাংলা ডাবিং ", "Nouman Ali Khan Bangla Dubbing Lecture");
		addVideoItem("Yy0yHkk3Xww", "শয়তান যেভাবে পেছন দিক থেকে আক্রমণ করে - উস্তাদ নোমান আলী খান ", "আলহামদুলিল্লাহ।সমস্থ প্রসংসা একমাত্র আল্লাহ তাআলার জন‍্য");
		addVideoItem("4fHvizV_9xA", "রাসূলুল্লাহ (সাঃ) এর সাথে আমাদের সম্পর্ক কেমন হওয়া উচিত ? - নোমান আলী খান", "উস্তাদ নোমান আলী খান বাংলা আলোচনা। ");

		createPlayList("নোমান আলী খান বাংলা লেকচার", R.drawable.nouman);

		//==========================================================================
		addVideoItem("85P3JT5k_m4", "জুমু'আর খুতবাহ : রমাদানের প্রস্তুতি ", "জুমু'আর খুতবাহ : রমাদানের প্রস্তুতি ।। Dr. Mohammad Monzur-E-Elahi");

		addVideoItem("fUbCFm4Xvjk", "জুমু'আর খুতবাহঃ রমাদানের আমলসমূহ ", "জুমু'আর খুতবাহঃ রমাদানের আমলসমূহ ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("PsdVsFaLSsE", "জুমু'আর খুতবাহঃ রমাদানের শেষ দশকের আমল এবং ইতিকাফ ", "জুমু'আর খুতবাহঃ রমাদানের শেষ দশকের আমল এবং ইতিকাফ ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("Hw2o-ZGNHrM", "রমাদান মাসের আগে ও পরে আমাদের অবস্থা ", "রমাদান মাসের আগে ও পরে আমাদের অবস্থা ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("EtrW5fUQgus", "হজ্জের শিক্ষা এবং হজ্জ পরবর্তী করণীয় ", "হজ্জের শিক্ষা এবং হজ্জ পরবর্তী করণীয়।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("uHxBFgb6WTk", "বিড়াল পালন করা কি সুন্নাহ্‌? ", "বিড়াল পালন করা কি সুন্নাহ্‌? Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("rUrDHhLHNIs", "আদর্শ পরিবার গঠনে ইসলামের নীতিমালা (পর্ব-১) ", "আদর্শ পরিবার গঠনে ইসলামের নীতিমালা (পর্ব-১)");
		addVideoItem("cg2Zw8rxH_w", "আদর্শ পরিবার গঠনে ইসলামের নীতিমালা (পর্ব-২) ", "আদর্শ পরিবার গঠনে ইসলামের নীতিমালা (পর্ব-২)");
		addVideoItem("wp8YoesqORg", "সোশ্যাল নেটওয়ার্কের ক্ষতিকর দিক এবং আমাদের করণীয় ", "সোশ্যাল নেটওয়ার্কের ক্ষতিকর দিক এবং আমাদের করণীয়");
		addVideoItem("56FHeuoCEC8", "মুহাররম মাসের ফযীলত ও আমল ", "মুহাররম মাসের ফযীলত ও আমল");
		addVideoItem("ifsAFQPl9i0", "রিযিকে বারাকাহ লাভের উপায় এবং প্রতিবন্ধক বিষয়সমূহ ", "রিযিকে বারাকাহ লাভের উপায় এবং প্রতিবন্ধক বিষয়সমূহ");
		addVideoItem("S_9Svi-k9oQ", "সামাজিক অবক্ষয় রোধে বিবাহের গুরুত্ব ", "সামাজিক অবক্ষয় রোধে বিবাহের গুরুত্ব");
		addVideoItem("E1xJ6jTzVy0", "তাকবীর থেকে সালাম ফেরানো পর্যন্ত সালাতের উত্তম পদ্ধতি  ", "তাকবীর থেকে সালাম ফেরানো পর্যন্ত সালাতের উত্তম পদ্ধতি ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("s03MNGlMpTI", "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সীরাত ও সুন্নাহ অনুসরণের গুরুত্ব ও মর্যাদা। ", "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সীরাত ও সুন্নাহ অনুসরণের গুরুত্ব ও মর্যাদা।");

		addVideoItem("qLcgD_Y-Phk", "জুমু'আর খুতবাহ: সীরাহ বিষয়ক ধারাবাহিক জুমু'আর খুতবাহ (পর্ব-১) ", "জুমু'আর খুতবাহ: সীরাহ বিষয়ক ধারাবাহিক জুমু'আর খুতবাহ (পর্ব-১)");
		addVideoItem("zEcUjP1MudI", "জুমু'আর খুতবাহ: সীরাহ বিষয়ক ধারাবাহিক জুমু'আর খুতবাহ (পর্ব-২) ", "জুমু'আর খুতবাহ: সীরাহ বিষয়ক ধারাবাহিক জুমু'আর খুতবাহ (পর্ব-২)");
		addVideoItem("9oAYIn3GEJk", "জুমু'আর খুতবাহ : রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের হিজরত (পর্ব-৩) ", "জুমু'আর খুতবাহ : রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের হিজরত (পর্ব-৩)");
		addVideoItem("jA69w9LVEZg", "রাসূল ﷺ এর সিরাতে মদীনার সনদ ", "রাসূল ﷺ এর সিরাতে মদীনার সনদ। Dr. Mohammad Monzur-E-Elahi (পর্ব-৪) শেষ পর্ব");

		addVideoItem("a-JTeLoVXm0", "জুমু'আর খুতবাহ : পাপ থেকে বাঁচার উপায় ", "জুমু'আর খুতবাহ : পাপ থেকে বাঁচার উপায় ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("8DeTEj07PCg", "'ইসলাম' সন্ত্রাস নয়, শান্তি ও নিরাপত্তার দীন ", "ইসলাম' সন্ত্রাস নয়, শান্তি ও নিরাপত্তার দীন ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("jFXGB6q8Gng", "ঈমানের দুর্বলতা এবং এর চিকিৎসা ", "ঈমানের দুর্বলতা এবং এর চিকিৎসা");
		addVideoItem("WVzmw1w3V80", "কীভাবে নফসের কু-প্রবৃত্তি নিয়ন্ত্রণ করব? ", "কীভাবে নফসের কু-প্রবৃত্তি নিয়ন্ত্রণ করব?");
		addVideoItem("aOyhVpwOrms", "হাই কমোড ব্যবহারে পবিত্রতা রক্ষা করা ", "হাই কমোড ব্যবহারে পবিত্রতা রক্ষা করা");
		addVideoItem("QD_6_cZXgxw", "জুমু'আর খুতবাহ : আল্লাহ তা'আলার ক্ষমা থেকে নিরাশ হবেন না ", "জুমু'আর খুতবাহ : আল্লাহ তা'আলার ক্ষমা থেকে নিরাশ হবেন না ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("q6lPwONpV70", "জুমু'আর খুতবাহ : সন্তান প্রতিপালনে ইসলামের দিকনির্দেশনা ", "জুমু'আর খুতবাহ : সন্তান প্রতিপালনে ইসলামের দিকনির্দেশনা ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("7N6Vdu8FKOs", "জুমু'আর খুতবাহ : মাতা-পিতার প্রতি সন্তানের দায়িত্ব ও কর্তব্য  ", "জুমু'আর খুতবাহ : মাতা-পিতার প্রতি সন্তানের দায়িত্ব ও কর্তব্য ।। Dr. Mohammad Monzur-E-Elahi");

		addVideoItem("nBSFpYql6SQ", "মোহরানা আদায়ের সঠিক নিয়ম ", "মোহরানা আদায়ের সঠিক নিয়ম ।। Dr. Mohammad Monzur-E-Elahi");
		addVideoItem("lv3K7xpaD1E", "দেনমোহরের সর্বনিম্ন পরিমাণ কতো ", "দেনমোহরের সর্বনিম্ন পরিমাণ কতো ।। Dr. Mohammad Monzur-E-Elahi ");
		addVideoItem("aTYp48tIq1M", "বিয়ে সংক্রান্ত প্রশ্নোত্তর ।। পর্ব ০২ ", "বিয়ে সংক্রান্ত প্রশ্নোত্তর ।। পর্ব ০২ ");
		addVideoItem("1hqtkcqF-R0", "বিয়ে সংক্রান্ত প্রশ্নোত্তর ।। পর্ব ০৩ ", "বিয়ে সংক্রান্ত প্রশ্নোত্তর ।। পর্ব ০৩");

		addVideoItem("T8yPLPHf2R0", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-১) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-১) ।।  Dr. Mohammad Monzur-E-Elahi ");
		addVideoItem("IMVSjQ6ibPI", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-২) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-২) ।।  Dr. Mohammad Monzur-E-Elahi ");
		addVideoItem("1OcDBW9C3Os", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৩) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৩)।।  Dr. Mohammad Monzur-E-Elahi ");
		addVideoItem("FiUfdED13aY", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৪) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৪) বিষয়ঃ ইয়াওমে আরাফার ফযীলত ও আমল ");
		addVideoItem("kZEzqJP5x6U", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৫) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-১) ।।  Dr. Mohammad Monzur-E-Elahi ");
		addVideoItem("lsT-6F-iKB0", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৬) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৬) বিষয়ঃ ইয়াওমুন নাহার বা কুরবানীর দিনের আমলসমূহ");
		addVideoItem("UeUosnVIclo", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৭) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৭) বিষয়ঃ আইয়ামে তাশরীক কী ও কেন এবং এর আমলগুলো কী?");
		addVideoItem("lsT-6F-iKB0", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৬) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৬) বিষয়ঃ ইয়াওমুন নাহার বা কুরবানীর দিনের আমলসমূহ");
		addVideoItem("UeUosnVIclo", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৭) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৭) বিষয়ঃ আইয়ামে তাশরীক কী ও কেন এবং এর আমলগুলো কী?");
		addVideoItem("UeUosnVIclo", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৭) ", "যিলহজ্জ মাসের ফযীলত ও করণীয় আমল (পর্ব-৭) বিষয়ঃ আইয়ামে তাশরীক কী ও কেন এবং এর আমলগুলো কী?");
		createPlayList("ড. মোহাম্মদ মানজুরে ইলাহী", R.drawable.manzoor);
		//-------------------------------------------------------------------------------------------
		addVideoItem("zE_WFiHnSlY", "Surah Al-Fatihah - সূরা আল ফাতিহা বাংলা অনুবাদ সহ ", "Surah Al-Fatihah - সূরা আল ফাতিহা বাংলা অনুবাদ সহ | Quran Recitation | Surah 01");
		addVideoItem("AnO-X6tgiRs", "Surah Ad-Dhuha - সূরা আদ-দুহা বাংলা অনুবাদ সহ ", "Surah Ad-Dhuha - সূরা আদ-দুহা বাংলা অনুবাদ সহ | Quran Recitation | Surah 93");
		addVideoItem("H2hhGSEknkE", "Surah Ash-Sharh - সূরা আশ-শারহ বাংলা অনুবাদ সহ ", "সূরা আশ-শারহ বাংলা অনুবাদ সহ| Quran Recitation | Surah 94");
		addVideoItem("XR3yuhq8-v", "Surah At-Tin - সূরা আত-তীন বাংলা অনুবাদ সহ ", "Surah At-Tin - সূরা আত-তীন বাংলা অনুবাদ সহ | Quran Recitation | Surah 95");
		addVideoItem("p6EtgQZfwsQ", "Surah Al-Qadr - সূরা আল-ক্বাদর বাংলা অনুবাদ সহ ", "Surah Al-Qadr - সূরা আল-ক্বাদর বাংলা অনুবাদ সহ | Quran Recitation | Surah 97");
		addVideoItem("Mda-1DO7XUM", "Surah Az-Zalzalah - সূরা আয-যালযালাহ্ বাংলা অনুবাদ সহ ", "Surah Az-Zalzalah - সূরা আয-যালযালাহ্ বাংলা অনুবাদ সহ| Quran Recitation | Surah 99");
		addVideoItem("PwBsIsvZo78", "Surah At-Takathur - সূরা আত-তাকাসুর বাংলা অনুবাদ সহ ", "Surah At-Takathur - সূরা আত-তাকাসুর বাংলা অনুবাদ সহ  | Quran Recitation | Surah 102");
		addVideoItem("_rjgqUPXIXs", "Surah Ad-Asr - সূরা আল-‘আসর বাংলা অনুবাদ সহ ", "Surah Ad-Asr - সূরা আল-‘আসর বাংলা অনুবাদ সহ| Quran Recitation | Surah 103");
		addVideoItem("OscMyxCioZ8", "Surah Ad-Fil - সূরা আল-ফীল বাংলা অনুবাদ সহ ", "Surah Ad-Fil - সূরা আল-ফীল বাংলা অনুবাদ সহ | Quran Recitation | Surah 105");
		//addVideoItem("AnO-X6tgiRs", "Surah Ad-Dhuha - সূরা আদ-দুহা বাংলা অনুবাদ সহ ", "Surah Ad-Dhuha - সূরা আদ-দুহা বাংলা অনুবাদ সহ | Quran Recitation | Surah 93");
		addVideoItem("EMKO5k_xiRE", "Surah Qurasish - সূরা ক্বুরাইশ বাংলা অনুবাদ সহ ", "Surah Qurasish - সূরা ক্বুরাইশ বাংলা অনুবাদ সহ| Quran Recitation | Surah 106");
		addVideoItem("rB1TOVHZ4CM", "Surah Al-Maun - সূরা আল-মা‘ঊন বাংলা অনুবাদ সহ ", "Surah Al-Maun - সূরা আল-মা‘ঊন বাংলা অনুবাদ সহ | Quran Recitation | Surah 107");
		addVideoItem("ifq6UO66g78", "Surah Al-Kawser - সূরা আল-কাউসার বাংলা অনুবাদ সহ ", "Surah Al-Kawser - সূরা আল-কাউসার বাংলা অনুবাদ সহ | Quran Recitation | Surah 108");
		addVideoItem("ZaHspJ0gRK8", "Surah Al-Kafirun - সূরা আল-কাফিরূন বাংলা অনুবাদ সহ ", "Surah Al-Kafirun - সূরা আল-কাফিরূন বাংলা অনুবাদ সহ| Quran Recitation | Surah 109");
		addVideoItem("GnOmpk-XFww", "Surah An-Nasr - সূরা আন-নাসর বাংলা অনুবাদ সহ ", "Surah An-Nasr - সূরা আন-নাসর বাংলা অনুবাদ সহ| Quran Recitation | Surah 110");
		addVideoItem("robx49fFmbk", "Surah Lahab/Al-Masad - সূরা আল-মাসাদ বাংলা অনুবাদ সহ ", "Surah Lahab/Al-Masad - সূরা আল-মাসাদ বাংলা অনুবাদ সহ | Quran Recitation | Surah 111");
		addVideoItem("UcxK4qDRMxk", "Surah Al-Ikhlas - সূরা আল-ইখলাস বাংলা অনুবাদ সহ ", "Surah Al-Ikhlas - সূরা আল-ইখলাস বাংলা অনুবাদ সহ | Quran Recitation | Surah 112");
		addVideoItem("oUb2UluKw7Q", "Surah Al-Falaq - সূরা আল-ফালাক্ব বাংলা অনুবাদ সহ ", "Surah Al-Falaq - সূরা আল-ফালাক্ব বাংলা অনুবাদ সহ | Quran Recitation | Surah 113");
		addVideoItem("EnRhAvlb9a4", "Surah An-Nas - সূরা আন-নাস বাংলা অনুবাদ সহ ", "Surah An-Nas - সূরা আন-নাস বাংলা অনুবাদ সহ | Quran Recitation | Surah 114");
		createPlayList("কুরআন তিলাওয়াত (বাংলা অর্থসহ)", R.drawable.r4);

//----------------------------------------------------------------
		addVideoItem("b7IKdxn1TtQ", "ধার্মিক, কিন্তু জাহান্নামী || মুফতি মেঙ্ক - Mufti Menk ", "আল্লাহ আমাদের এসব মন্দ চরিত্র থেকে হেফাজত করুক।");
		addVideoItem("wad1QltnSQQ", "তাজউইদ শিখুন সহজেই — Lesson 7B | অনুশীলনী ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");

		addVideoItem("UZbdy7l7elg", "একজন নারী যেভাবে হাঁটেন ", "সুবাহানাল্লাহ!! কি অসাধারণ বিশ্লেষণ!! এনিমেশন টাও অনেক সুন্দর। জাযাকাল্লাহু খাইর।");
		addVideoItem("50kNC0dUWeg", "ইমাম মাহদী - ড. ইয়াসির ক্কাদি | সব পর্ব একত্রে (পর্ব ১ - ৩) ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("w2ELr136Ms8", "যে দুআ সকল মুশকিল আহসান করে দেয়", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("XoJfbBCW834", "Father and the Crow || একজন বাবা এবং কাকের গল্প", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("3ULVeVclx6c", "বোনদের জন্য সুন্দর একটি উপদেশ - মুহাম্মাদ এলশিনাওয়ে", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("zfEyrUJJ_Zk", "আই এম দ্যা বেস্ট মুসলিম - সিজনঃ১ - সকল পর্ব একত্রে ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("rm5qoOYqj-U", "প্রথম পর্ব: শয়তানের খুতবা। ইয়াসির ক্বাদী ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("BvlQ7pQMoZo", "আই এম দ্যা বেস্ট মুসলিম! পর্ব ২ ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("DjHx0AL7sVk", "আই এম দ্যা বেস্ট মুসলিম! পর্ব ৭ ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("BBKHfoADJnc", "পর্নগ্রাফির আসক্তি -- পর্ব ১ঃ কিভাবে আসক্তি কাজ করে? ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("pmc5q5KpXgc", " কুরআন ও সালাহ বুঝুন আরো সহজ উপায়ে ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,, ");
		addVideoItem("EAThPvE0VOA", "বিয়ের আগের প্রেম, থামুন! ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,, ");
		addVideoItem("PbSJ0iHLK28", "আল্লাহ্‌র মত কেউ আপনাকে ভালবাসে না ", "বর্তমান সময়ের জন্য উপযুক্ত একটি ভিডিও। আল্লাহ আমাদের সবাইকে দ্বীন অনুসারে চলার তৌফিক দান করুন, আমিন।");
		addVideoItem("zFUfiG_-Or4", "আই এম দ্যা বেস্ট মুসলিম! পর্ব ৩ ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("6eZ4QVrGFeU", "আপনার জীবন মাত্র একদিনের ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("WT1XGNFTKHQ", "রাগ সংবরণ করা আল্লাহর পক্ষ থেকে আসে", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("23z0jAp8GhY", "কুর'আনে তিন হুমকির কথা - নোমান আলী খান", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("6Kk8qzzHcdk", "একজন কোমল হৃদয়ের মানুষের গল্প ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("ldXFIYzY9xg", "যখন আপনি নিজেকে পরিবর্তনের সিদ্ধান্ত নিবেন", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("w3lZrGjLmPI", "ছোট শিরক ১ - ছোট শিরক কোনটিকে বলে", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("SDoQv4lMATI", "সূরা ফাতিহা - আল্লাহর সাথে একটি পবিত্র কথোপকথন ", "আল্লাহ পাক যেন আমাদের সবাইকে হেদায়েত দান করেন সঠিক বুঝ দান করেন,,");
		addVideoItem("AA1mFXxT9FI", "দোয়া কবুল হচ্ছে না কেন? - ওমর সুলাইমান ", "আমরা মানুষ। আমরা ভুল করবো এটা স্বাভাবিক কিন্তু আমাদের কে তাওবা করতে হবে কারণ আল্লাহ অতি ‌ ক্ষমাশীল ");
		addVideoItem("01kvNBji9d4", "আল্লাহ কেন মানুষকে কঠিন পরীক্ষায় ফেলেন?", "প্রফেটস সিরিজ ॥ ২৪তম পর্ব ॥ ঈসা আঃ এর জীবনী এবং আমাদের শিক্ষা");
		addVideoItem("w36X557hjP8", "“দাজ্জালের থেকেও ভয়ংকর” || শায়খ আহমাদুল্লাহ ", "আল্লাহ আমাদের প্রকাশ্য–ওপ্রকাশ্য সকল শির্ক থেকে হেফাজত করুন, আল্লাহুমা আমিন।");
		createPlayList("ইসলামিক কার্টুন", R.drawable.c);
//-----------------------------------------------------------------
		addVideoItem("tpnyxWrb3ic", "এলো খুশির ঈদ | Ramjaner Rojar Sheshe Elo Khushir Eid | রমজানের ঐ রোজার শেষে এলো খুশির ঈদ", "#Romjaneroirojarshesheelokhushireid #ঈদেরগান #EidSong");
		addVideoItem("oA03cLkNEsg", "চমৎকার নজরুল সংগীত । ত্রিভুবনের প্রিয় মুহাম্মদ । Nazrul Geeti । Islamic Song by Kalarab ", "Song : Tri Voboner Prio Mohammad");

		addVideoItem("USIZ1-YCauA", "সময়ের সেরা ঈমান জাগানিয়া গজল । Tumi Kemon Musolman । তুমি কেমন মুসলমান । Sayed Ahmad", "#TumiKemonMusolman #সময়েরসেরাঈমানজাগানিয়াগজল #তুমিকেমনমুসলমান");
		addVideoItem("KGOoLw2NyGU", "কান্না চলে আসার মত সেরা গজল । Ami Etim Bole । আমি এতিম বলে । Jahidul Islam Shawon, Kalarab,Holy", "AmiEtimBole #কান্নাচলেআসারসেরাগজল #আমিএতিমবলে");
		addVideoItem("lIQNPWskjuk", "Bangla Islamic Song | Ami Dekhini Tomay by Kalarab Shilpigosthi 2018 | Naate Rasul Sallallah", "Title: Ami Dekhini Tomay ");
		addVideoItem("AXEOHr5naKs", "শিশুদের কন্ঠে দারুণ গজল । এলো খুশির বরাত । Elo Khushir Borat By Kalarab Shilpigosthi", "Title: Elo Khushir Borat");
		addVideoItem("GK2ippphNnM", "হৃদয়স্পর্শী মরমি গজল | Hariye Jabo Ekdin | হারিয়ে যাবো একদিন | Qari Abu Rayhan", "Song: Hariye Jabo Ekdin Ami");
		addVideoItem("8DnoQnyQm4U", "প্রিয় নবীর অবমাননার প্রতিবাদে জ্বালাময়ী গজল ।Nobijir Dushmon । Sayed Ahmad Kalarab", "SayedAhmadKalarab #প্রিয়নবীরঅবমাননারপ্রতিবাদেজ্বালাময়ীগজল #NobijirDushmon");
		addVideoItem("QyRRrKQP7fo", "নতুন ইসলামিক গজল ২০১৯ | Hridoy Majhe Mala Gathi | হৃদয় মাঝে মালা গাঁথি । Mahfuz Alam । Tawhid Jamil ", "Song: Hridoy Majhe Mala Gathi");
		addVideoItem("NfIlMOukA90", "কোকিল কণ্ঠে মরমি গজল । Koto Janazar Porechi Namaj । Hujaifa Islam | Bangla Gojol 2020", "AbuRayhanHujaifaIslam #JanazaGojol #কোকিলকণ্ঠেমরমিগজল");
		addVideoItem("-Q_L3nQopvw", "হৃদয় ছুঁয়ে যাওয়া ইসলামী সঙ্গীত আল্লাহ্‌ আল্লাহ্‌ | Allah Allah By Kalarab", "Song: Allah Allah");
		addVideoItem("rMygn1nwHrE", "বাছাইকৃত সেরা গজল | Top Bangla Islamic Song 2018 | Popular Islamic Gojol | হামদ পর্ব ০১", "মন শীতল হয়ে যায় এমন সুন্দর গজল শুনে ");
		addVideoItem("atQxJYVRpvA", "নতুন ইসলামী সংগীত । Ami Chaina Bachte - Kalarab । Abu Rayhan And Mahfuzul Alam", "Song: Ami Chaina Bachte");
		addVideoItem("LhXjfdDzFIQ", "যাদুকরী কণ্ঠে হৃদয়স্পর্শী গজল । Amaro Chilo Sob Ekadin । Hujaifa Islam Kalarab ।Heart Touching Song", "Newbanglaislamicsong2020 #যাদুকরীকণ্ঠেহৃদয়স্পর্শীগজল #আমারওছিলসবএকদিন ");
		addVideoItem("UrC50KP_08o", "শিশুশিল্পীদের রমজানের নতুন গজল | Elo Mahe Ramjan | এলো মাহে রমজান | Ramadan Song - Kalarab", "RamjanSong #RamjanGojol #KalarabGojol");
		addVideoItem("LXtM24VXBDc", "Bangla New Islamic Song With English Subtitle | SalliAla Muhammad | Kalarab Shilpigosthi", "Title: SalliAla Muhammad");
		addVideoItem("srU9CCeGtwU", "টাকা নিয়ে ফাটাফাটি গজল | Ajob Taka | আজব টাকা | Muhammad Badruzzaman | Kalarab | Bangla Song", "MuhammadBadruzzaman #টাকানিয়েফাটাফাটিগজল #HolyTune");
		addVideoItem("OUub8-7cqYI", "পর্দা নিয়ে সময়ের সেরা গজল । Porda Narir Ruper Vushon । Sayed Ahmad Kalarab । Muhammad Badruzzaman", "পর্দানিয়েসময়েরসেরাগজল #SayedAhmadKalarab #PordaNarirRuperVushon");
		addVideoItem("X5FQMoEkpt4", "Bangla Gojol | Rongin E Prithibi Charite Hoibe | Sayed Ahmad | Aynuddin Al Azad", "Title : Rongin AI Prithibi");
		createPlayList("ইসলামিক গজল", R.drawable.msq);









	}

	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>
	//---------------------------------------------------->>>>>>




}

